Merge pull request #23 from wine-5/feature/stage-editor
Feature/stage editor
